nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
        <register>
          <name>DR_CLEAR</name>
          <description>GPIO data register CLEAR</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR_CLEAR</name>
              <description>Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR_TOGGLE</name>
          <description>GPIO data register TOGGLE</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR_TOGGLE</name>
              <description>Toggle</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO1</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401B8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO1_INT0</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT1</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT2</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT3</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT4</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT5</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT6</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_INT7</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_0_15</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_Combined_16_31</name>
        <value>81</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO2</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401BC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO2_Combined_0_15</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_Combined_16_31</name>
        <value>83</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO3</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO3_Combined_0_15</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_Combined_16_31</name>
        <value>85</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO4</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO4_Combined_0_15</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_Combined_16_31</name>
        <value>87</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO10</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x401C8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO10_Combined_0_31</name>
        <value>71</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO6</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x42000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO7</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x42004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO8</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x42008000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO5">
      <name>GPIO9</name>
      <description>GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x4200C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x90</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO6_7_8_9</name>
        <value>157</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADC1</name>
      <description>Analog-to-Digital Converter</description>
      <groupName>ADC</groupName>
      <prependToName>ADC1_</prependToName>
      <headerStructName>ADC</headerStructName>
      <baseAddress>0x400C4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC1</name>
        <value>67</value>
      </interrupt>
      <registers>
        <register>
          <name>HC0</name>
          <description>Control register for hardware triggers</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input Channel Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_10</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_11</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_12</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_13</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_14</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_15</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_16</name>
                  <description>External channel selection from ADC_ETC</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_25</name>
                  <description>VREFSH = internal channel, for ADC self-test, hard connected to VRH internally</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_31</name>
                  <description>Conversion Disabled. Hardware Triggers will not initiate any conversion.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Conversion Complete Interrupt Enable/Disable Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIEN_0</name>
                  <description>Conversion complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIEN_1</name>
                  <description>Conversion complete interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7</dimIndex>
          <name>HC%s</name>
          <description>Control register for hardware triggers</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADCH</name>
              <description>Input Channel Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCH_0</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_1</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_2</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_3</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_4</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_5</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_6</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_7</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_8</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_9</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_10</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_11</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_12</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_13</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_14</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_15</name>
                  <description>External channels 0 to 15 See External Signals for more information</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_16</name>
                  <description>External channel selection from ADC_ETC</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_25</name>
                  <description>VREFSH = internal channel, for ADC self-test, hard connected to VRH internally</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCH_31</name>
                  <description>Conversion Disabled. Hardware Triggers will not initiate any conversion.</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIEN</name>
              <description>Conversion Complete Interrupt Enable/Disable Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AIEN_0</name>
                  <description>Conversion complete interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AIEN_1</name>
                  <description>Conversion complete interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HS</name>
          <description>Status register for HW triggers</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COCO0</name>
              <description>Conversion Complete Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO1</name>
              <description>Conversion Complete Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO2</name>
              <description>See description for COCO1.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO3</name>
              <description>See description for COCO1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO4</name>
              <description>See description for COCO1.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO5</name>
              <description>See description for COCO1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO6</name>
              <description>See description for COCO1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCO7</name>
              <description>See description for COCO1.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>R0</name>
          <description>Data result register for HW triggers</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Data (result of an ADC conversion)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>7</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7</dimIndex>
          <name>R%s</name>
          <description>Data result register for HW triggers</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CDATA</name>
              <description>Data (result of an ADC conversion)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
