nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
        <register>
          <name>USB1_CHRG_DETECT_TOG</name>
          <description>USB Charger Detect Register</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CHK_CONTACT</name>
              <description>Check the contact of USB plug</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check the contact of USB plug.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether the USB plug has been in contact with each other</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHK_CHRG_B</name>
              <description>Check the charger connection</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHECK</name>
                  <description>Check whether a charger (either a dedicated charger or a host charger) is connected to USB port.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CHECK</name>
                  <description>Do not check whether a charger is connected to the USB port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_B</name>
              <description>Control the charger detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable the charger detector.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable the charger detector.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_STAT</name>
          <description>USB VBUS Detect Status Register</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SESSEND</name>
              <description>Session End for USB OTG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BVALID</name>
              <description>Indicates VBus is valid for a B-peripheral</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVALID</name>
              <description>Indicates VBus is valid for a A-peripheral</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBUS_VALID</name>
              <description>VBus valid for USB OTG</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT_STAT</name>
          <description>USB Charger Detect Status Register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>State of the USB plug contact detector.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CONTACT</name>
                  <description>The USB plug has not made contact.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GOOD_CONTACT</name>
                  <description>The USB plug has made good contact.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>State of charger detection. This bit is a read only version of the state of the analog signal.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHARGER_NOT_PRESENT</name>
                  <description>The USB port is not connected to a charger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGER_PRESENT</name>
                  <description>A charger (either a dedicated charger or a host charger) is connected to the USB port.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>DM line state output of the charger detector.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>DP line state output of the charger detector.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_SET</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_CLR</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x1E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_LOOPBACK_TOG</name>
          <description>USB Loopback Test Register</description>
          <addressOffset>0x1EC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UTMI_TESTSTART</name>
              <description>Setting this bit can enable 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_MISC</name>
          <description>USB Misc Register</description>
          <addressOffset>0x1F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_MISC_SET</name>
          <description>USB Misc Register</description>
          <addressOffset>0x1F4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_MISC_CLR</name>
          <description>USB Misc Register</description>
          <addressOffset>0x1F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_MISC_TOG</name>
          <description>USB Misc Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HS_USE_EXTERNAL_R</name>
              <description>Use external resistor to generate the current bias for the high speed transmitter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_DEGLITCH</name>
              <description>Enable the deglitching circuit of the USB PLL output.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_CLK_UTMI</name>
              <description>Enables the clk to the UTMI block.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_VBUS_DETECT</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_VBUS_DETECT_SET</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB2_VBUS_DETECT_CLR</name>
          <description>USB VBUS Detect Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Set the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V4</name>
                  <description>4.4V (default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4V7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_PWRUP_CMPS</name>
              <description>Powers up comparators for vbus_valid detector.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>USB OTG discharge VBUS.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHARGE_VBUS</name>
              <description>USB OTG charge VBUS.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
