nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
        <register>
          <name>CSI_HSYNC_SELECT_INPUT</name>
          <description>CSI_HSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x420</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_15_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_B0_15 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_07_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_B1_07 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_14_ALT2</name>
                  <description>Selecting Pad: GPIO_B1_14 for Mode: ALT2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_PIXCLK_SELECT_INPUT</name>
          <description>CSI_PIXCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_04_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_B1_04 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_12_ALT2</name>
                  <description>Selecting Pad: GPIO_B1_12 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSI_VSYNC_SELECT_INPUT</name>
          <description>CSI_VSYNC_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x428</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_14_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_B0_14 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_06_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_B1_06 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_13_ALT2</name>
                  <description>Selecting Pad: GPIO_B1_13 for Mode: ALT2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_IPG_CLK_RMII_SELECT_INPUT</name>
          <description>ENET_IPG_CLK_RMII_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x42C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_10_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_10 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_MDIO_SELECT_INPUT</name>
          <description>ENET_MDIO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B1_05_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B1_05 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_41_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_41 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_15_ALT0</name>
                  <description>Selecting Pad: GPIO_B1_15 for Mode: ALT0</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET0_RXDATA_SELECT_INPUT</name>
          <description>ENET0_RXDATA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_20_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_20 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_04_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_04 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET1_RXDATA_SELECT_INPUT</name>
          <description>ENET1_RXDATA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x438</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_19_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_19 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_05_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_05 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_RXEN_SELECT_INPUT</name>
          <description>ENET_RXEN_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x43C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_06_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_06 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_RXERR_SELECT_INPUT</name>
          <description>ENET_RXERR_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_26_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_26 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_11_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_11 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET0_TIMER_SELECT_INPUT</name>
          <description>ENET0_TIMER_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_AD_B0_15_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_B0_15 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_11_ALT7</name>
                  <description>Selecting Pad: GPIO_AD_B0_11 for Mode: ALT7</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_12_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_12 for Mode: ALT3</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_TXCLK_SELECT_INPUT</name>
          <description>ENET_TXCLK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_10_ALT3</name>
                  <description>Selecting Pad: GPIO_B1_10 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXCAN1_RX_SELECT_INPUT</name>
          <description>FLEXCAN1_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x44C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_03_ALT4</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_18_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_18 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B1_09_ALT2</name>
                  <description>Selecting Pad: GPIO_AD_B1_09 for Mode: ALT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B0_03_ALT2</name>
                  <description>Selecting Pad: GPIO_B0_03 for Mode: ALT2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXCAN2_RX_SELECT_INPUT</name>
          <description>FLEXCAN2_RX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x450</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_10_ALT3</name>
                  <description>Selecting Pad: GPIO_EMC_10 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_03_ALT0</name>
                  <description>Selecting Pad: GPIO_AD_B0_03 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_15_ALT6</name>
                  <description>Selecting Pad: GPIO_AD_B0_15 for Mode: ALT6</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_09_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_09 for Mode: ALT6</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA3_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA3_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_SD_B1_00_ALT2</name>
                  <description>Selecting Pad: GPIO_SD_B1_00 for Mode: ALT2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_12_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_12 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_EMC_38_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_38 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_AD_B0_10_ALT1</name>
                  <description>Selecting Pad: GPIO_AD_B0_10 for Mode: ALT1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_B1_00_ALT6</name>
                  <description>Selecting Pad: GPIO_B1_00 for Mode: ALT6</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA0_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA0_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_23_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_23 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_00_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_00 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA1_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA1_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x45C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_25_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_25 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_02_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_02 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA2_SELECT_INPUT</name>
          <description>FLEXPWM1_PWMA2_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x460</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPIO_EMC_27_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_27 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIO_SD_B0_04_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B0_04 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
