nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>KPP</name>
      <description>KPP</description>
      <groupName>KPP</groupName>
      <baseAddress>0x401FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>KPP</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>KPCR</name>
          <description>Keypad Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KRE</name>
              <description>KRE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KRE_0</name>
                  <description>Row is not included in the keypad key press detect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KRE_1</name>
                  <description>Row is included in the keypad key press detect.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KCO</name>
              <description>KCO</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TOTEM_POLE</name>
                  <description>Column strobe output is totem pole drive.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPEN_DRAIN</name>
                  <description>Column strobe output is open drain.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KPSR</name>
          <description>Keypad Status Register</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KPKD</name>
              <description>KPKD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KPKD_0</name>
                  <description>No key presses detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KPKD_1</name>
                  <description>A key has been depressed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KPKR</name>
              <description>KPKR</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KPKR_0</name>
                  <description>No key release detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KPKR_1</name>
                  <description>All keys have been released</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KDSC</name>
              <description>KDSC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KDSC_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KDSC_1</name>
                  <description>Set bits that clear the keypad depress synchronizer chain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KRSS</name>
              <description>KRSS</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KRSS_0</name>
                  <description>No effect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KRSS_1</name>
                  <description>Set bits which sets keypad release synchronizer chain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KDIE</name>
              <description>KDIE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KDIE_0</name>
                  <description>No interrupt request is generated when KPKD is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KDIE_1</name>
                  <description>An interrupt request is generated when KPKD is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KRIE</name>
              <description>KRIE</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KRIE_0</name>
                  <description>No interrupt request is generated when KPKR is set.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KRIE_1</name>
                  <description>An interrupt request is generated when KPKR is set.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KDDR</name>
          <description>Keypad Data Direction Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KRDD</name>
              <description>KRDD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>ROWn pin configured as an input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>ROWn pin configured as an output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KCDD</name>
              <description>KCDD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>COLn pin is configured as an input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>COLn pin is configured as an output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KPDR</name>
          <description>Keypad Data Register</description>
          <addressOffset>0x6</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KRD</name>
              <description>KRD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KCD</name>
              <description>KCD</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
