nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
        <register>
          <name>CR2</name>
          <description>CSI Control Register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSC</name>
              <description>Horizontal Skip Count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSC_0</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_1</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_2</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_3</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_4</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_5</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_6</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_7</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_8</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_9</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_250</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_251</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_252</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_253</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_254</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSC_255</name>
                  <description>Number of pixels to skip minus 1</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSC</name>
              <description>Vertical Skip Count. Contains the number of rows to skip. SCE must be 1, otherwise VSC is ignored.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSC_0</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_1</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_2</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_3</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_4</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_5</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_6</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_7</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_8</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_9</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_250</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_251</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_252</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_253</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_254</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSC_255</name>
                  <description>Number of rows to skip minus 1</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVRM</name>
              <description>Live View Resolution Mode. Selects the grid size used for live view resolution.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LVRM_0</name>
                  <description>512 x 384</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_1</name>
                  <description>448 x 336</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_2</name>
                  <description>384 x 288</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_3</name>
                  <description>384 x 256</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_4</name>
                  <description>320 x 240</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_5</name>
                  <description>288 x 216</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVRM_6</name>
                  <description>400 x 300</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTS</name>
              <description>Bayer Tile Start. Controls the Bayer pattern starting point.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BTS_0</name>
                  <description>GR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTS_1</name>
                  <description>RG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTS_2</name>
                  <description>BG</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BTS_3</name>
                  <description>GB</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCE</name>
              <description>Skip Count Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCE_0</name>
                  <description>Skip count disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCE_1</name>
                  <description>Skip count enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFS</name>
              <description>Auto Focus Spread. Selects which green pixels are used for auto-focus.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AFS_0</name>
                  <description>Abs Diff on consecutive green pixels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFS_1</name>
                  <description>Abs Diff on every third green pixels</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFS_2</name>
                  <description>Abs Diff on every four green pixels</description>
                  <value>#1x</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRM</name>
              <description>Double Resolution Mode. Controls size of statistics grid.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DRM_0</name>
                  <description>Stats grid of 8 x 6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DRM_1</name>
                  <description>Stats grid of 8 x 12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_BURST_TYPE_SFF</name>
              <description>Burst Type of DMA Transfer from STATFIFO. Selects the burst type of DMA transfer from STATFIFO.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_SFF_0</name>
                  <description>INCR8</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_SFF_1</name>
                  <description>INCR4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_SFF_3</name>
                  <description>INCR16</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_BURST_TYPE_RFF</name>
              <description>Burst Type of DMA Transfer from RxFIFO. Selects the burst type of DMA transfer from RxFIFO.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_RFF_0</name>
                  <description>INCR8</description>
                  <value>#x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_RFF_1</name>
                  <description>INCR4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BURST_TYPE_RFF_3</name>
                  <description>INCR16</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
