nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
        <register>
          <name>CR18</name>
          <description>CSI Control Register 18</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2D000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEINTERLACE_EN</name>
              <description>This bit is used to select the output method When input is standard BT.656 video.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEINTERLACE_EN_0</name>
                  <description>Deinterlace disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLACE_EN_1</name>
                  <description>Deinterlace enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARALLEL24_EN</name>
              <description>Enable bit for Parallel RGB888/YUV444 24bit input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARALLEL24_EN_0</name>
                  <description>Input is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PARALLEL24_EN_1</name>
                  <description>Input is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASEADDR_SWITCH_EN</name>
              <description>When this bit is enabled, CSI DMA will switch the base address according to BASEADDR_SWITCH_SEL rather than automatically by DMA completed</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEADDR_SWITCH_SEL</name>
              <description>CSI 2 base addresses switching method. When using this bit, BASEADDR_SWITCH_EN is 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BASEADDR_SWITCH_SEL_0</name>
                  <description>Switching base address at the edge of the vsync</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASEADDR_SWITCH_SEL_1</name>
                  <description>Switching base address at the edge of the first data of each frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIELD0_DONE_IE</name>
              <description>In interlace mode, field 0 means interrupt enabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIELD0_DONE_IE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIELD0_DONE_IE_1</name>
                  <description>Interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_FIELD1_DONE_IE</name>
              <description>When in interlace mode, field 1 done interrupt enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_FIELD1_DONE_IE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_FIELD1_DONE_IE_1</name>
                  <description>Interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_DMA_REQ_SEL</name>
              <description>Choosing the last DMA request condition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAST_DMA_REQ_SEL_0</name>
                  <description>fifo_full_level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_DMA_REQ_SEL_1</name>
                  <description>hburst_length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASEADDR_CHANGE_ERROR_IE</name>
              <description>Base address change error interrupt enable signal.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BASEADDR_CHANGE_ERROR_IE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASEADDR_CHANGE_ERROR_IE_1</name>
                  <description>Interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RGB888A_FORMAT_SEL</name>
              <description>Output is 32-bit format.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB888A_FORMAT_SEL_0</name>
                  <description>{8'h0, data[23:0]}</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888A_FORMAT_SEL_1</name>
                  <description>{data[23:0], 8'h0}</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_HPROT</name>
              <description>Hprot value in AHB bus protocol.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_OPTION</name>
              <description>These bits used to choose the method to mask the CSI input.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_OPTION_0</name>
                  <description>Writing to memory (OCRAM or external DDR) from first completely frame, when using this option, the CSI_ENABLE should be 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_OPTION_1</name>
                  <description>Writing to memory when CSI_ENABLE is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_OPTION_2</name>
                  <description>Writing to memory from second completely frame, when using this option, the CSI_ENABLE should be 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_OPTION_3</name>
                  <description>Writing to memory when data comes in, not matter the CSI_ENABLE is 1 or 0.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSI_ENABLE</name>
              <description>CSI global enable signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR19</name>
          <description>CSI Control Register 19</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_RFIFO_HIGHEST_FIFO_LEVEL</name>
              <description>This byte stores the highest FIFO level achieved by CSI FIFO timely and will be clear by writing 8'ff to it</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
