nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
        <register>
          <name>PORTSC1</name>
          <description>Port Status &amp; Control</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCS</name>
              <description>Current Connect Status-Read Only</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CSC</name>
              <description>Connect Status Change-R/WC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PE</name>
              <description>Port Enabled/Disabled-Read/Write</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEC</name>
              <description>Port Enable/Disable Change-R/WC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCA</name>
              <description>Over-current Active-Read Only</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCA_0</name>
                  <description>This port does not have an over-current condition.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCA_1</name>
                  <description>This port currently has an over-current condition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCC</name>
              <description>Over-current Change-R/WC</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPR</name>
              <description>Force Port Resume -Read/Write</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend - Read/Write or Read Only</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PR</name>
              <description>Port Reset - Read/Write or Read Only</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSP</name>
              <description>High-Speed Port - Read Only</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LS</name>
              <description>Line Status-Read Only</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LS_0</name>
                  <description>SE0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_1</name>
                  <description>K-state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_2</name>
                  <description>J-state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS_3</name>
                  <description>Undefined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PP</name>
              <description>Port Power (PP)-Read/Write or Read Only</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PO</name>
              <description>Port Owner-Read/Write</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIC</name>
              <description>Port Indicator Control - Read/Write</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIC_0</name>
                  <description>Port indicators are off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_1</name>
                  <description>Amber</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_2</name>
                  <description>Green</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PIC_3</name>
                  <description>Undefined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTC</name>
              <description>Port Test Control - Read/Write</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTC_0</name>
                  <description>TEST_MODE_DISABLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_1</name>
                  <description>J_STATE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_2</name>
                  <description>K_STATE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_3</name>
                  <description>SE0 (host) / NAK (device)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_4</name>
                  <description>Packet</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_5</name>
                  <description>FORCE_ENABLE_HS</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_6</name>
                  <description>FORCE_ENABLE_FS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTC_7</name>
                  <description>FORCE_ENABLE_LS</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKCN</name>
              <description>Wake on Connect Enable (WKCNNT_E) - Read/Write</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKDC</name>
              <description>Wake on Disconnect Enable (WKDSCNNT_E) - Read/Write</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKOC</name>
              <description>Wake on Over-current Enable (WKOC_E) - Read/Write</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHCD</name>
              <description>PHY Low Power Suspend - Clock Disable (PLPSCD) - Read/Write</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHCD_0</name>
                  <description>Enable PHY clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHCD_1</name>
                  <description>Disable PHY clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFSC</name>
              <description>Port Force Full Speed Connect - Read/Write</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFSC_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFSC_1</name>
                  <description>Forced to full speed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTS_2</name>
              <description>See description at bits 31-30</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSPD</name>
              <description>Port Speed - Read Only. This register field indicates the speed at which the port is operating.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PSPD_0</name>
                  <description>Full Speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSPD_1</name>
                  <description>Low Speed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSPD_2</name>
                  <description>High Speed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PSPD_3</name>
                  <description>Undefined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTW</name>
              <description>Parallel Transceiver Width This bit has no effect if serial interface engine is used</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PTW_0</name>
                  <description>Select the 8-bit UTMI interface [60MHz]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PTW_1</name>
                  <description>Select the 16-bit UTMI interface [30MHz]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Serial Transceiver Select 1 Serial Interface Engine is selected 0 Parallel Interface signals is selected Serial Interface Engine can be used in combination with UTMI+/ULPI physical interface to provide FS/LS signaling instead of the parallel interface signals</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTS_1</name>
              <description>All USB port interface modes are listed in this field description, but not all are supported</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTGSC</name>
          <description>On-The-Go Status &amp; control</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1120</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VD</name>
              <description>VBUS_Discharge - Read/Write. Setting this bit causes VBus to discharge through a resistor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VC</name>
              <description>VBUS Charge - Read/Write</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OT</name>
              <description>OTG Termination - Read/Write</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DP</name>
              <description>Data Pulsing - Read/Write</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDPU</name>
              <description>ID Pullup - Read/Write This bit provide control over the ID pull-up resistor; 0 = off, 1 = on [default]</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID</name>
              <description>USB ID - Read Only. 0 = A device, 1 = B device</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVV</name>
              <description>A VBus Valid - Read Only. Indicates VBus is above the A VBus valid threshold.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASV</name>
              <description>A Session Valid - Read Only. Indicates VBus is above the A session valid threshold.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSV</name>
              <description>B Session Valid - Read Only. Indicates VBus is above the B session valid threshold.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSE</name>
              <description>B Session End - Read Only. Indicates VBus is below the B session end threshold.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOG_1MS</name>
              <description>1 millisecond timer toggle - Read Only. This bit toggles once per millisecond.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPS</name>
              <description>Data Bus Pulsing Status - Read Only</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDIS</name>
              <description>USB ID Interrupt Status - Read/Write</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVVIS</name>
              <description>A VBus Valid Interrupt Status - Read/Write to Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASVIS</name>
              <description>A Session Valid Interrupt Status - Read/Write to Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSVIS</name>
              <description>B Session Valid Interrupt Status - Read/Write to Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSEIS</name>
              <description>B Session End Interrupt Status - Read/Write to Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STATUS_1MS</name>
              <description>1 millisecond timer Interrupt Status - Read/Write to Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPIS</name>
              <description>Data Pulse Interrupt Status - Read/Write to Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDIE</name>
              <description>USB ID Interrupt Enable - Read/Write. Setting this bit enables the USB ID interrupt.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVVIE</name>
              <description>A VBus Valid Interrupt Enable - Read/Write. Setting this bit enables the A VBus valid interrupt.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASVIE</name>
              <description>A Session Valid Interrupt Enable - Read/Write</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSVIE</name>
              <description>B Session Valid Interrupt Enable - Read/Write</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSEIE</name>
              <description>B Session End Interrupt Enable - Read/Write. Setting this bit enables the B session end interrupt.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_1MS</name>
              <description>1 millisecond timer Interrupt Enable - Read/Write</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPIE</name>
              <description>Data Pulse Interrupt Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
