nxp-mcuxpresso/mcux-soc-svd/MIMXRT1062/MIMXRT1062.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>AOI1</name>
      <description>AOI</description>
      <groupName>AOI</groupName>
      <headerStructName>AOI</headerStructName>
      <baseAddress>0x403B4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BFCRT010</name>
          <description>Boolean Function Term 0 and 1 Configuration Register for EVENTn</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PT1_DC</name>
              <description>Product term 1, D input configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_DC_0</name>
                  <description>Force the D input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_DC_1</name>
                  <description>Pass the D input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_DC_2</name>
                  <description>Complement the D input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_DC_3</name>
                  <description>Force the D input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_CC</name>
              <description>Product term 1, C input configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_CC_0</name>
                  <description>Force the C input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_CC_1</name>
                  <description>Pass the C input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_CC_2</name>
                  <description>Complement the C input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_CC_3</name>
                  <description>Force the C input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_BC</name>
              <description>Product term 1, B input configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_BC_0</name>
                  <description>Force the B input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_BC_1</name>
                  <description>Pass the B input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_BC_2</name>
                  <description>Complement the B input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_BC_3</name>
                  <description>Force the B input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT1_AC</name>
              <description>Product term 1, A input configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT1_AC_0</name>
                  <description>Force the A input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_AC_1</name>
                  <description>Pass the A input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_AC_2</name>
                  <description>Complement the A input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT1_AC_3</name>
                  <description>Force the A input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_DC</name>
              <description>Product term 0, D input configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_DC_0</name>
                  <description>Force the D input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_DC_1</name>
                  <description>Pass the D input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_DC_2</name>
                  <description>Complement the D input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_DC_3</name>
                  <description>Force the D input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_CC</name>
              <description>Product term 0, C input configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_CC_0</name>
                  <description>Force the C input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_CC_1</name>
                  <description>Pass the C input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_CC_2</name>
                  <description>Complement the C input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_CC_3</name>
                  <description>Force the C input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_BC</name>
              <description>Product term 0, B input configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_BC_0</name>
                  <description>Force the B input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_BC_1</name>
                  <description>Pass the B input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_BC_2</name>
                  <description>Complement the B input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_BC_3</name>
                  <description>Force the B input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT0_AC</name>
              <description>Product term 0, A input configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT0_AC_0</name>
                  <description>Force the A input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_AC_1</name>
                  <description>Pass the A input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_AC_2</name>
                  <description>Complement the A input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT0_AC_3</name>
                  <description>Force the A input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BFCRT230</name>
          <description>Boolean Function Term 2 and 3 Configuration Register for EVENTn</description>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>PT3_DC</name>
              <description>Product term 3, D input configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT3_DC_0</name>
                  <description>Force the D input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_DC_1</name>
                  <description>Pass the D input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_DC_2</name>
                  <description>Complement the D input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_DC_3</name>
                  <description>Force the D input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT3_CC</name>
              <description>Product term 3, C input configuration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT3_CC_0</name>
                  <description>Force the C input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_CC_1</name>
                  <description>Pass the C input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_CC_2</name>
                  <description>Complement the C input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_CC_3</name>
                  <description>Force the C input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT3_BC</name>
              <description>Product term 3, B input configuration</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT3_BC_0</name>
                  <description>Force the B input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_BC_1</name>
                  <description>Pass the B input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_BC_2</name>
                  <description>Complement the B input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_BC_3</name>
                  <description>Force the B input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT3_AC</name>
              <description>Product term 3, A input configuration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT3_AC_0</name>
                  <description>Force the A input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_AC_1</name>
                  <description>Pass the A input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_AC_2</name>
                  <description>Complement the A input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT3_AC_3</name>
                  <description>Force the A input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_DC</name>
              <description>Product term 2, D input configuration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT2_DC_0</name>
                  <description>Force the D input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_DC_1</name>
                  <description>Pass the D input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_DC_2</name>
                  <description>Complement the D input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_DC_3</name>
                  <description>Force the D input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_CC</name>
              <description>Product term 2, C input configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT2_CC_0</name>
                  <description>Force the C input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_CC_1</name>
                  <description>Pass the C input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_CC_2</name>
                  <description>Complement the C input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_CC_3</name>
                  <description>Force the C input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_BC</name>
              <description>Product term 2, B input configuration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT2_BC_0</name>
                  <description>Force the B input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_BC_1</name>
                  <description>Pass the B input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_BC_2</name>
                  <description>Complement the B input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_BC_3</name>
                  <description>Force the B input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT2_AC</name>
              <description>Product term 2, A input configuration</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT2_AC_0</name>
                  <description>Force the A input in this product term to a logical zero</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_AC_1</name>
                  <description>Pass the A input in this product term</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_AC_2</name>
                  <description>Complement the A input in this product term</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT2_AC_3</name>
                  <description>Force the A input in this product term to a logical one</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
